In [5]:
import pandas as pd
from sqlalchemy import create_engine
from config import pword

In [3]:
# store csv into dataframe
# u_s_all_grades_all_formulations_retail_gasoline_prices_weekly
csv_file = "Resources/u_s_all_grades_all_formulations_retail_gasoline_prices_weekly.csv"
gas_data = pd.read_csv(csv_file)
gas_data.head()

      week_of  dollars_per_gallon
0  2021-09-06               3.273
1  2021-08-30               3.237
2  2021-08-23               3.243
3  2021-08-16               3.272
4  2021-08-09               3.269

In [15]:
gas_data = gas_data.rename(columns={'week_of':'date', 'dollars_per_gallon':'gas_price'})
gas_data

            date  gas_price
0     2021-09-06      3.273
1     2021-08-30      3.237
2     2021-08-23      3.243
3     2021-08-16      3.272
4     2021-08-09      3.269
...          ...        ...
1479  1993-05-03      1.086
1480  1993-04-26      1.086
1481  1993-04-19      1.079
1482  1993-04-12      1.079
1483  1993-04-05        NaN

[1484 rows x 2 columns]

In [22]:
gas_data = gas_data.dropna()
gas_data

            date  gas_price
0     2021-09-06      3.273
1     2021-08-30      3.237
2     2021-08-23      3.243
3     2021-08-16      3.272
4     2021-08-09      3.269
...          ...        ...
1478  1993-05-10      1.097
1479  1993-05-03      1.086
1480  1993-04-26      1.086
1481  1993-04-19      1.079
1482  1993-04-12      1.079

[1344 rows x 2 columns]

In [23]:
rds_connection_string = f"postgres:{pword}@localhost:5432/ETL_project"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [24]:
engine.table_names()

<ipython-input-24-d72bc75a6b62>:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['sunspots', 'gas_prices', 'tesla_stock', 'bitcoin']

In [26]:
gas_data.to_sql(name='gas_prices', con=engine, if_exists='append', index=False)